//  let p1 = prompt('Какое название вашего города?');
//  if (p1 == 'Osh') {
//    alert('Ваш город оочень красив!');
//  } else {
//    alert('Вы не знаете свой город?');
//  }

// let p3 = prompt("Сколько тебе лет?");

// p3 < 3
//   ? alert("Привет Малыш!")
//   : p3 > 18
//   ? alert("Здраствуйте!")
//   : p3 < 18
//   ? alert("Привет Пацан!")
//   : alert("Привет!")

// let p3 = prompt("Оффициальное название JavaScript?");

// p3 == "ECMAScript" ? alert("Верно!")
// : alert("Вы не знаете ECMAScript?");

// let p2 = prompt("Сколько тебе лет?");
// if (p2 < 3) {
//   alert("Привет Малыш!");
// } else if (p2 > 18) {
//   alert("Здраствуйте!");
// } else if (p2 < 18) {
//   alert("Привет Пацан!");
// } else {
//   alert("Привет!");
// }

// let p5 = prompt("В каком году была опубликована спецификация ECMAScript-2015?")

//   p5 < 2015 ? alert("Слишком рано")
//  :p5 > 2015 ? alert("Слишком поздно")
//  :alert("Верно")

//  let p6 = prompt("Вы кто такой?")

//   p6 == "Сотрудник" ? alert("Привет")
//  :p6 == "Директор" ? alert("Здраствуйте")
//  :p6 == " " ? alert("Нет догина")
//  :alert("")

// let p7 = prompt("Ведите число");
// let p8 = prompt("Ведите ещё число");
// +p7 + +p8 < 4 ?  alert("Мало") :  alert("Много")


